import { Component } from '@angular/core';

@Component({
  selector: 'app-don',
  templateUrl: './don.component.html',
  styleUrls: ['./don.component.css']
})
export class DonComponent {
   list_benevolats: any[] = [
    {
      id: 1,
      title: 'زكاة الفطر',
      image: 'assets/imgs/zakat.jpg',
      description:
        'زكاة الفطر واجبة على كل مسلم يملك قوت نفسه ، ومن تلزمه نفقته يوم العيد وليلته فضلا عن حوائجه الأصلية ، ويلزمه إخراج صدقة زوجته وأولاده الصغار الذين لا مال لهم ، ولا يلزمه صدقة الفطر عن أولاده الذين لا تجب نفقتهم عليه .',
    },
    {
      id: 2,
      title: 'التبرع بلباس العيد',
      image: 'assets/imgs/lebsa.webp',
      description:
        'التبرع بكسوة العيد للأطفال النازحين والمهجرين ، من أفضل الأعمال الصالحة إسعاد قلوب الناس ، وتلبية اِحتياجاتهم ، وعن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال:(من لبس المسلم ثوباً في عريته غطاه الله بخضر الجنة) .',
    },
    {
      id: 3,
      title: 'كفارة العاجز عن الصيام',
      image: 'assets/imgs/التبرع.jpg',
      description:
        'إنها سلسلة من الكلمات اللاتينية التي ، عند وضعها في موضعها ، لا تشكل جملًا بمعنى كامل ، ولكنها تعطي الحياة لنص اختبار مفيد لملء الفراغات التي يتم شغلها لاحقًا من نصوص مخصصة كتبها متخصصون في الاتصال.',
    },
  ];
 
}
